CFDEM/CFDEMcoupling-PUBLIC-5.x/tutorials/cfdemSolverRhoPimple/comprErgunTestMPI/CFD/constant/couplingProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/


FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          couplingProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//===========================================================================//
// sub-models & settings

syncMode false;
//verbose;

solveFlow on; 

modelType "B"; // A or B

couplingInterval 200;

voidFractionModel divided;//centre;//

locateModel engine;//turboEngine;//

meshMotionModel noMeshMotion;

regionModel allRegion;

IOModel sophIO; //basicIO;

probeModel off;

dataExchangeModel twoWayMPI;//twoWayM2M;//twoWayFiles;//oneWayVTK;//

averagingModel dense;//dilute;//

clockModel standardClock;//off;

smoothingModel off;// constDiffSmoothing; //

forceModels
(
    //GidaspowDrag
    //BeetstraDrag
    DiFeliceDrag
    //gradPForce
    //viscForce
    //KochHillDrag
    //Archimedes
    //volWeightedAverage
    //particleCellVolume
    //fieldTimeAverage
    Archimedes
);

energyModels
(
    heatTransferGunn
);

chemistryModels
(
    off
);

thermCondModel SyamlalThermCond;

momCoupleModels
(
    implicitCouple
   // explicitCouple //XXX: not functional with current solver
);

turbulenceModelType "turbulenceProperties";//"LESProperties";//

//===========================================================================//
// sub-model properties

heatTransferGunnProps
{
    partTempName 	"Temp";
    partHeatFluxName 	"convectiveHeatFlux";
    calcPartTempField 	true;
    partRefTemp 		293;
    interpolation 		true;
}

SyamlalThermCondProps
{
}

constDiffSmoothingProps
{
    lowerLimit 0.1;
    upperLimit 1e10;
    smoothingLength 1.5e-3;
}

implicitCoupleProps
{
    velFieldName "U";
    granVelFieldName "Us";
    voidfractionFieldName "voidfraction";
}
explicitCoupleProps
{
    //fLimit (0 0 0);
}

ArchimedesProps
{
    gravityFieldName "g";
}
gradPForceProps
{
    pFieldName "p";
    voidfractionFieldName "voidfraction";
    velocityFieldName "U";
    interpolation true;
}

viscForceProps
{
    velocityFieldName "U";
    interpolation true;
}
volWeightedAverageProps
{
    scalarFieldNames
    (
        voidfraction
    );
    vectorFieldNames
    (
    );
    upperThreshold 0.999;
    lowerThreshold 0;
    verbose true;
}

GidaspowDragProps
{
    verbose true;
    velFieldName "U";
    granVelFieldName "Us";
    voidfractionFieldName "voidfraction";
    interpolation true;
    phi 1;
}

DiFeliceDragProps
{
    //verbose true;
    //velFieldName "U";
    //voidfractionFieldName "voidfraction";
    //granVelFieldName "Us";
    interpolation true;
}

KochHillDragProps
{
    //verbose true;
    velFieldName "U";
    voidfractionFieldName "voidfraction";
    interpolation true;
    //forceSubModels
    //(
    //    ImExCorr
    //);
    implForceDEM true;
    //implForceDEMaccumulated true;
    //explicitCorr true;
}

BeetstraDragProps
{
    velFieldName "U";
    gravityFieldName "g";
    rhoParticle     2000.;
    voidfractionFieldName "voidfraction";
    interpolation ;
    useFilteredDragModel ;
    useParcelSizeDependentFilteredDrag ;
    k       0.05;
    aLimit  0.0;
//    verbose true;
}

virtualMassForceProps
{
    velFieldName "U";
}

particleCellVolumeProps
{
    upperThreshold 0.999;
    lowerThreshold 0.;
    verbose true;
}

fieldStoreProps
{
    scalarFieldNames
    (
    );

    vectorFieldNames
    (
        "U"
    );
}

oneWayVTKProps
{
    couplingFilename "vtk_out%4.4d.vtk";
    maxNumberOfParticles 30000;
}

twoWayFilesProps
{
    maxNumberOfParticles 10100;
}

centreProps
{
    alphaMin 0.1;
}

engineProps
{
    treeSearch true;
}

turboEngineProps
{
    treeSearch true;
}

dividedProps
{
    alphaMin 0.01;
    scaleUpVol 1.0;
}

twoWayMPIProps
{
    liggghtsPath "../DEM/in.liggghts_run";
}
twoWayM2MProps
{
    maxNumberOfParticles 10100;
    liggghtsPath "../DEM/in.liggghts_run";
}
// ************************************************************************* //
