CFDEM/CFDEMcoupling-PUBLIC-5.x/tutorials/cfdemSolverRhoPimple/comprErgunTestMPI/CFD/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
transportModel  Newtonian;

nu              nu [ 0 2 -1 0 0 0 0 ] 1.6e-05;

kf		kf [ 1 1 -3 -1 0 0 0 ] 0.026;

Cp		Cp [ 0 2 -2 -1 0 0 0 ] 1005;

// room T values

//nu              nu [ 0 2 -1 0 0 0 0 ] 1.7e-05;

//kf		kf [ 1 1 -3 -1 0 0 0 ] 0.024;

//Cp		Cp [ 0 2 -2 -1 0 0 0 ] 1010;

//DT              DT [ 0 2 -1 0 0 0 0 ] 1.9994e-05;  // lambda/(rho*Cp) = 0.024/(1.1885*1010)

// ************************************************************************* //
